
Функция ПолучитьПоказатели() ЭКспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Прокси.Ссылка КАК Ссылка,
	|	Прокси.Использован КАК Использован,
	|	Прокси.Работает КАК Работает,
	|	Прокси.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Прокси КАК Прокси";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Всего 			= РезультатЗапроса.НайтиСтроки(Новый Структура("ПометкаУдаления", Ложь)).Количество();
	Заблокированных = РезультатЗапроса.НайтиСтроки(Новый Структура("ПометкаУдаления, Работает", Ложь, Ложь)).Количество();
	Использованных  = РезультатЗапроса.НайтиСтроки(Новый Структура("ПометкаУдаления, Работает, Использован", Ложь, Истина, Истина)).Количество();
	Работает  		= РезультатЗапроса.НайтиСтроки(Новый Структура("ПометкаУдаления, Работает, Использован", Ложь, Истина, Ложь)).Количество();

	Структура = Новый Структура;
	
	Структура.Вставить("Всего", 			Всего);
	Структура.Вставить("Заблокированных", 	Заблокированных);
	Структура.Вставить("Использованных", 	Использованных);
	Структура.Вставить("Работает", 			Работает);

	Возврат Структура;
	
КонецФункции

Процедура Очистить_ПереченьПрокси() Экспорт
	
	ОМ_Прокси.Очистить_ПереченьПрокси();
	
КонецПроцедуры

Функция КоличествоЭлементовПрокси() Экспорт
	
	Возврат ОМ_Прокси.Получить_ПереченьПрокси(Истина).Количество();
	
КонецФункции