
Процедура ОчиститьЖурналПотоков() Экспорт
	
	НоваяЗапись = РегистрыСведений.ИсторияПотоков.СоздатьНаборЗаписей();
	НоваяЗапись.Записывать = Истина;
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьПоток(ИД, ИмяМетода) ЭКспорт
	
	Набор = РегистрыСведений.ИсторияПотоков.СоздатьНаборЗаписей();
	Набор.Отбор.Ид.Установить(ИД);
	Набор.Отбор.ИмяМетода.Установить(ИмяМетода);
	
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 Тогда
		
		Возврат Набор[0];
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

 Функция ВыполнитьПоток(Поток) Экспорт
	
	Попытка
		
		Запись 				= РегистрыСведений.ИсторияПотоков.СоздатьМенеджерЗаписи();
		
		Запись.ДатаЗапуска  = ТекущаяДата();
		
		Запись.ИД 			= Поток.Ключ;
		Запись.ИмяМетода 	= Поток.ИмяМетода;
		Запись.Запущен 		= Истина;
		
		Запись.Записать();
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(Поток.ИмяМетода, Поток.Параметры, Строка(Поток.Ключ), Поток.Наименование);
		
		Возврат ФоновоеЗадание;
		
	Исключение
		
		ОМ_Сервер.НоваяЗаписьЖурнала(0, "ИсторияПотоков.ВыполнитьПоток", ОписаниеОшибки());
		
	КонецПопытки;
		
КонецФункции