
&НаСервере
Процедура ПоказыватьОкноПриИзмененииНаСервере()
	
	Константы.Конфигурация_ПоказыватьИзменения.Установить(ПоказыватьОкно);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОкноПриИзменении(Элемент)
	
	ПоказыватьОкноПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Константы.Конфигурация_ВерсияБД.Установить(Метаданные.Версия);
	
	ПоказыватьОкно 		= Константы.Конфигурация_ПоказыватьИзменения.Получить();

	Если Параметры.Свойство("ОписаниеОбновлений") Тогда
		ОписаниеОбновлений 	= Параметры.ОписаниеОбновлений;
	Иначе
		ОписаниеОбновлений  = ОМ_Служебный.Получить_ОписаниеОбновлений();
	КонецЕсли;
	
	НовоеВВерсии 		= ОписаниеОбновлений.НовоеВВерсии;
	
	Если ОписаниеОбновлений.НужноОбновить
		И ОписаниеОбновлений.ЭтоКритикал Тогда
		
		ЭтаФорма.Доступность =  Ложь;
		
	КонецЕсли;
	
	Если ОписаниеОбновлений.НужноОбновить Тогда
		ЭтаФорма.Заголовок = Метаданные.Синоним + ": " + ОписаниеОбновлений.ТекущаяВерсия + " -> " + ОписаниеОбновлений.АктуальнаяВерсия;	
	Иначе
		ЭтаФорма.Заголовок = Метаданные.Синоним + ": " + ОписаниеОбновлений.ТекущаяВерсия;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		
		Если Не ЭтаФорма.Доступность Тогда
			ЗавершитьРаботуСистемы(Ложь, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонфигурацию(Команда)
	
	ОткрытьФорму("ОбщаяФорма.АвтообновлениеКонфигурации", Новый Структура("ЭтоПринудительноеОбновление", Не ЭтаФорма.Доступность), ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры
