
Процедура ИнициализацияСправочника() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КаталогиЗагрузки.Ссылка КАК Ссылка,
	|	КаталогиЗагрузки.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.КаталогиЗагрузки КАК КаталогиЗагрузки
	|ГДЕ
	|	КаталогиЗагрузки.Предопределенный
	|	И НЕ КаталогиЗагрузки.Настроен";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Каталог Из РезультатЗапроса Цикл
		
		СпрОбъект = Каталог.Ссылка.ПолучитьОбъект();
		
		Если СпрОбъект.ИмяПредопределенныхДанных = "Локальный" Тогда
			
			СпрОбъект.ТипКаталога = Перечисления.ТипыКаталогов.Локальный;
			
		Иначе
			СпрОбъект.ТипКаталога = Перечисления.ТипыКаталогов.ВебХранилище;
		КонецЕсли;		
			
		СпрОбъект.Настроен = Истина;
		
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		
		СпрОбъект.Записать();
			
	КонецЦикла;
	
	ДропБокс_Объект = Справочники.КаталогиЗагрузки.ДропБокс.Ссылка.ПолучитьОбъект();
	
	ДропБокс_Объект.ОбменДанными.Загрузка = Истина;
	ДропБокс_Объект.НеРаботает = Истина;
	ДропБокс_Объект.Записать();
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Ссылка.Предопределенный Тогда
		
		Если Данные.Ссылка.ИмяПредопределенныхДанных = "Локальный" Тогда
			
			Представление = Данные.Наименование + ": " + Данные.Ссылка.Адрес;
			
		ИначеЕсли Данные.Ссылка.ИмяПредопределенныхДанных = "ГуглДиск"
			Или Данные.Ссылка.ИмяПредопределенныхДанных = "ЯндексДиск" Тогда
			
			Представление = Данные.Наименование + ": " + Данные.Ссылка.ИмяПользователя;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
