
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОМ_Клиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЖурнал(Команда)
	
	ОМ_Клиент.ОчиститьЖурналСобытий();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	
	Индекс = 0;
	
	Пока Истина Цикл
		
		Попытка
			
			Элементы.Список.ТекущаяСтрока = Индекс;
			Индекс = Индекс + 1;
			
		Исключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПервоначальнаяНастройкаОткрывалась = ОМ_Служебный.ПервоначальнаяНастройкаОткрывалась();
	
	Если Не ПервоначальнаяНастройкаОткрывалась Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
