
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоПомощник") Тогда
		
		ЭтоПомощник = Истина;
		
		ОМ_Сервер.СообщитьПользователю("Среди загруженных разделов нужно указать те, которые следует обходить во время загрузки.
		|Для этого, нужно открыть раздел и активировать флажок " + """" + "Отслеживать" +"""",,, "Список");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПомощник Тогда
		
		СтандартнаяОбработка = Ложь;
				
		ФормаЭлемента = ПолучитьФорму("Справочник.ГруппыКонфигураций.Форма.ФормаЭлемента", Новый Структура("ЭтоПомощник, Ключ", , ТекДанные.Ссылка), ЭтаФорма);
		ФормаЭлемента.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
