

&НаКлиенте
Функция Получить_СтруктуруПрокси_Строкой_НаКлиенте() Экспорт

	Возврат ОМ_Прокси.Получить_СтруктуруПрокси_Строкой();
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗаголовокОтвета_НаКлиенте(Знач Заголовки, Заголовок) Экспорт
	
	Возврат ОМ_Соединения.ПолучитьЗаголовокОтвета(Заголовки, Заголовок);
	
КонецФункции

&НаКлиенте
Функция Получить_ДатуПоследнегоОбращения_НаКлиенте() Экспорт
	
	Возврат ОМ_Прокси.Получить_ДатуПоследнегоОбращения();
	
КонецФункции

&НаКлиенте
Функция Получить_АктуальныйПрокси_НаКлиенте() Экспорт
	
	Возврат ОМ_Прокси.Получить_АктуальныйПрокси();
	
КонецФункции

&НаКлиенте
Процедура Сохранить_АктуальныйПрокси_НаКлиенте(ОписаниеПроки) Экспорт
	
	ОМ_Прокси.Сохранить_АктуальныйПрокси(ОписаниеПроки);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить_ДатуПоследнегоОбращения_НаКлиенте(Дата) Экспорт
	
	ОМ_Прокси.Сохранить_ДатуПоследнегоОбращения(Дата);
	
КонецПроцедуры

&НаКлиенте
Функция Получить_Ключ_HideMe_НаКлиенте() Экспорт
	
	Возврат ОМ_Прокси.Получить_Ключ_HideMe();
	
КонецФункции

&НаКлиенте
Функция ОбработатьМассивПрокси_НаКлиенте(ИсходныйТекст, Знач ФорматВывода) Экспорт
	
	Возврат ОМ_Прокси.ОбработатьМассивПроксиНаСервере(ИсходныйТекст, ФорматВывода);
	
КонецФункции

&НаКлиенте
Функция СформироватьПараметрыЗапроса_НаКлиенте(СписокПараметров, КакМассив = Ложь) Экспорт
	
	Возврат ОМ_Соединения.СформироватьПараметрыЗапроса(СписокПараметров, КакМассив);
	
КонецФункции

&НаКлиенте
Функция СписокДопустимыхСтран_НаКлиенте() Экспорт
	
	Возврат ОМ_Прокси.Получить_СписокДопустимыхСтранПрокси();
		
КонецФункции

&НаКлиенте
Функция СтруктураURI_НаКлиенте(Знач СтрокаURI) Экспорт
	
	Возврат ОМ_Соединения.СтруктураURI(СтрокаURI);
	
КонецФункции

&НаКлиенте
Функция НовыйФильтрПоКлассуТега_НаКлиенте(Тег, Класс, ТочноеСоответствие = Истина) Экспорт  
	
	Возврат ОМ_Парсинг.НовыйФильтрПоКлассуТега(Тег, Класс, ТочноеСоответствие);
	
КонецФункции


////////////////////////СЕРВЕР////////////////////////////////////////////////////////////

&НаСервере
Функция Получить_СтруктуруПрокси_Строкой_НаСервере() Экспорт

	Возврат ОМ_Прокси.Получить_СтруктуруПрокси_Строкой();
	
КонецФункции

&НаСервере
Функция ПолучитьЗаголовокОтвета_НаСервере(Знач Заголовки, Заголовок) Экспорт
	
	Возврат ОМ_Соединения.ПолучитьЗаголовокОтвета(Заголовки, Заголовок);
	
КонецФункции

&НаСервере
Функция Получить_ДатуПоследнегоОбращения_НаСервере() Экспорт
	
	Возврат ОМ_Прокси.Получить_ДатуПоследнегоОбращения();
	
КонецФункции

&НаСервере
Функция Получить_АктуальныйПрокси_НаСервере() Экспорт
	
	Возврат ОМ_Прокси.Получить_АктуальныйПрокси();
	
КонецФункции

&НаСервере
Процедура Сохранить_АктуальныйПрокси_НаСервере(ОписаниеПроки) Экспорт
	
	ОМ_Прокси.Сохранить_АктуальныйПрокси(ОписаниеПроки);
	
КонецПроцедуры

&НаСервере
Процедура Сохранить_ДатуПоследнегоОбращения_НаСервере(Дата) Экспорт
	
	ОМ_Прокси.Сохранить_ДатуПоследнегоОбращения(Дата);
	
КонецПроцедуры

&НаСервере
Функция Получить_Ключ_HideMe_НаСервере() Экспорт
	
	Возврат ОМ_Прокси.Получить_Ключ_HideMe();
	
КонецФункции

&НаСервере
Функция Обработать_МассивПрокси_НаСервере(ИсходныйТекст, Знач ФорматВывода) Экспорт
	
	Возврат ОМ_Прокси.ОбработатьМассивПроксиНаСервере(ИсходныйТекст, ФорматВывода);
	
КонецФункции

&НаСервере
Функция СформироватьПараметрыЗапроса_НаСервере(СписокПараметров, КакМассив = Ложь) Экспорт
	
	Возврат ОМ_Соединения.СформироватьПараметрыЗапроса(СписокПараметров, КакМассив);
	
КонецФункции

&НаСервере
Функция СписокДопустимыхСтран_НаСервере() Экспорт
	
	Возврат ОМ_Прокси.Получить_СписокДопустимыхСтранПрокси();
		
КонецФункции

&НаСервере
Функция СтруктураURI_НаСервере(Знач СтрокаURI) Экспорт
	
	Возврат ОМ_Соединения.СтруктураURI(СтрокаURI);
	
КонецФункции

&НаСервере
Функция НовыйФильтрПоКлассуТега_НаСервере(Тег, Класс, ТочноеСоответствие = Истина) Экспорт  
	
	Возврат ОМ_Парсинг.НовыйФильтрПоКлассуТега(Тег, Класс, ТочноеСоответствие);
	
КонецФункции
