
&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокГрупп.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Владелец", ПредопределенноеЗначение("Справочник.ГруппыКонфигураций.ПустаяСсылка"));
		Возврат;
	КонецЕсли;
	
	ТекущийВладелец = ТекущиеДанные.Ссылка;
	
	Список.Параметры.УстановитьЗначениеПараметра("Владелец", ТекущийВладелец);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоПомощник") Тогда
		
		ЭтоПомощник = Истина;
		
		ОМ_Сервер.СообщитьПользователю("Среди загруженных конфигураций нужно указать те, которые следует обходить во время загрузки.
		|Для этого, нужно открыть раздел и активировать флажок " + """" + "Отслеживать" +"""",,, "Список");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПомощник Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ФормаЭлемента = ПолучитьФорму("Справочник.Конфигурации.Форма.ФормаЭлемента", Новый Структура("ЭтоПомощник, Ключ", , ТекДанные.Ссылка), ЭтаФорма);
		ФормаЭлемента.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
