
&НаКлиенте
Процедура ИспользоватьВсе(Команда)
	
	УстановитьПометкиПоСтранам(Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкиПоСтранам(Пометка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира
		|ГДЕ
		|	НЕ СтраныМира.ПометкаУдаления
		|	И НЕ СтраныМира.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Спр = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Спр.Использовать = Пометка;
		Спр.Записать();
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	УстановитьПометкиПоСтранам(Ложь);
	
КонецПроцедуры
