

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоПомощник") Тогда
		
		ЭтоПомощник = Истина;
		
		ОМ_Сервер.СообщитьПользователю("Среди предопределенных каталогов необходимо настроить те каталоги, которые Вам нужны.",,, "Список");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПомощник Тогда
		
		СтандартнаяОбработка = Ложь;
				
		ФормаЭлемента = ПолучитьФорму("Справочник.КаталогиЗагрузки.Форма.ФормаЭлемента", Новый Структура("ЭтоПомощник, Ключ", , ТекДанные.Ссылка), ЭтаФорма);
		ФормаЭлемента.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

