
// Уровень:
// 0 - Критикал
// 1 - Ошибка
// 2 - Описание
// 3 - Новый объект БД
Процедура ДобавитьЗапись(Уровень, Метод, Описание, ОбъектБД = Неопределено) Экспорт
	
	ДелатьЗаписи 			= Константы.Журнал_ВестиЛог.Получить();
	
	Если ДелатьЗаписи Тогда
		
		НоваяЗапись 			= РегистрыСведений.ЖурналСобытий.СоздатьМенеджерЗаписи();
		
		НоваяЗапись.Дата 		= ТекущаяДата();
		НоваяЗапись.ИД 			= Новый УникальныйИдентификатор;
		НоваяЗапись.Уровень 	= Уровень;
		НоваяЗапись.Метод 		= Метод;
		
		НоваяЗапись.Описание 	= Описание;
		
		Если ЗначениеЗаполнено(ОбъектБД) Тогда
			НоваяЗапись.Объект = ОбъектБД;
		КонецЕсли;
		
		НоваяЗапись.ПорядковыйНомер = ПолучитьНовыйПорядковыйНомер();
		
		НоваяЗапись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНовыйПорядковыйНомер() 
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕстьNull(МАКСИМУМ(ЖурналСобытий.ПорядковыйНомер),0) КАК ПорядковыйНомер
	|ИЗ
	|	РегистрСведений.ЖурналСобытий КАК ЖурналСобытий";
	
	ПоследнийНомер_Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПорядковыйНомер");
	
	Если ПоследнийНомер_Массив.Количество() > 0 Тогда
		
		Результат = ПоследнийНомер_Массив[0];
		
	КонецЕсли;
	
	Возврат Результат + 1;
	
КонецФункции

Процедура ОчиститьЖурналСобытий() Экспорт
	
	НоваяЗапись = РегистрыСведений.ЖурналСобытий.СоздатьНаборЗаписей();
	НоваяЗапись.Записывать = Истина;
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры
